ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
#if defined(CONFIG_PUTTTRACK_NFC_SERVICE)
#define NFC_NDEF_BUFFER_SIZE 160U
#define NFC_URI_BUFFER_SIZE 96U
#define NFC_SERVICE_DISCOVERY_WINDOW_MS 10000U
#define NFC_SYSTEM_OFF_DELAY_MS 2000U

static uint8_t nfc_ndef_buffer[NFC_NDEF_BUFFER_SIZE];
static atomic_t nfc_field_on_count;
static atomic_t nfc_field_off_count;
static atomic_t nfc_data_read_count;
static atomic_t nfc_field_present;
static atomic_t nfc_service_window_active;
static atomic_t nfc_service_window_open_count;
static atomic_t nfc_service_window_suppressed_count;
static int32_t nfc_setup_error;
static atomic_t system_off_pending;
static int32_t system_off_entry_error;
static bool nfc_system_off_wake;
static struct k_work nfc_service_window_open_work;
static struct k_work_delayable nfc_service_window_close_work;
#if defined(CONFIG_PUTTTRACK_NFC_SYSTEM_OFF_TEST)
static struct k_work_delayable system_off_work;
#endif
#endif

K_MUTEX_DEFINE(packet_mutex);
K_SEM_DEFINE(power_event_sem, 0, 1);

static void build_status_packet(void);
static void begin_sensor_recovery(uint32_t error_bits);
static void increment_saturating(uint32_t *value);

static void sample_battery(void)
{
	static const fuel_gauge_prop_t properties[] = {
		FUEL_GAUGE_VOLTAGE,
		FUEL_GAUGE_RELATIVE_STATE_OF_CHARGE,
	};
	union fuel_gauge_prop_val values[ARRAY_SIZE(properties)];
	int rc;

	battery_supported = device_is_ready(battery_fuel_gauge);
	battery_sample_valid = false;
	if (!battery_supported) {
		battery_sample_error = -ENODEV;
		return;
	}

	rc = fuel_gauge_get_props(battery_fuel_gauge, properties, values,
				  ARRAY_SIZE(properties));
	if (rc != 0) {
		battery_sample_error = rc;
		return;
	}
	if (values[0].voltage < 0 ||
	    values[1].relative_state_of_charge > 100U) {
		battery_sample_error = -ERANGE;
		return;
	}

	battery_voltage_mv = (uint32_t)values[0].voltage / 1000U;
	battery_soc_percent = values[1].relative_state_of_charge;
	battery_sample_error = 0;
	battery_sample_valid = true;
}

static const char *power_policy_name(enum putttrack_power_policy policy)
{
	switch (policy) {
	case PUTTTRACK_POWER_RESEARCH:
		return "research";
	case PUTTTRACK_POWER_IDLE:
		return "idle";
	case PUTTTRACK_POWER_AUTO:
	default:
		return "auto";
	}
}

static const char *runtime_state_name(enum putttrack_runtime_state state)
{
	return state == PUTTTRACK_RUNTIME_ACTIVE ? "active" : "idle";
}

static const char *sensor_health_name(enum putttrack_sensor_health health)
{
	switch (health) {
	case PUTTTRACK_SENSOR_SUSPECT:
		return "suspect";
	case PUTTTRACK_SENSOR_RECOVERING:
		return "recovering";
	case PUTTTRACK_SENSOR_DEGRADED:
		return "degraded";
	case PUTTTRACK_SENSOR_QUARANTINED:
		return "quarantined";
	case PUTTTRACK_SENSOR_HEALTHY:
	default:
		return "healthy";
	}
}

static void bytes_to_hex(const uint8_t *input, size_t input_len, char *output)
{
	static const char digits[] = "0123456789abcdef";

	for (size_t index = 0; index < input_len; index++) {
		output[index * 2] = digits[input[index] >> 4];
		output[index * 2 + 1] = digits[input[index] & 0x0f];
	}
}

static void initialize_advertising_name(void)
{
	const size_t prefix_len = sizeof(ADVERTISING_NAME_PREFIX) - 1U;
	const size_t suffix_len = MIN((size_t)device_id_len,
				      (size_t)ADVERTISING_NAME_SUFFIX_BYTES);

	memcpy(advertising_name, ADVERTISING_NAME_PREFIX, prefix_len);
	bytes_to_hex(device_id, suffix_len, &advertising_name[prefix_len]);
	advertising_name[prefix_len + suffix_len * 2U] = '\0';
}

static void motion_packet_to_pickup_sample(
	const uint8_t packet[MOTION_PACKET_SIZE], struct pt_pickup_sample *sample)
{
	memset(sample, 0, sizeof(*sample));
	sample->sequence = sys_get_le32(&packet[4]);
	sample->source_monotonic_us = sys_get_le64(&packet[8]);
	for (size_t axis = 0U; axis < 3U; axis++) {
		sample->accel_micro_ms2[axis] =
			(int32_t)sys_get_le32(&packet[28U + axis * 4U]);
		sample->gyro_micro_rads[axis] =
			(int32_t)sys_get_le32(&packet[40U + axis * 4U]);
	}
	sample->sensor_error_bits = sys_get_le32(&packet[52]);
	sample->adxl367_valid =
		(packet[1] & MOTION_FLAG_ADXL367_VALID) != 0U;
	sample->bmi270_valid = (packet[1] & MOTION_FLAG_BMI270_VALID) != 0U;
}

static int32_t pickup_shadow_scaled(double value, double scale)
{
	double scaled;

	if (!isfinite(value) || value < 0.0) {
		return -1;
	}
	scaled = value * scale;
	if (scaled >= INT32_MAX) {
		return INT32_MAX;
	}
	return (int32_t)(scaled + 0.5);
}

static int putttrack_mgmt_pickup_shadow_arm(struct smp_streamer *ctxt)
{
	zcbor_state_t *zse = ctxt->writer->zs;
	uint64_t go_us = k_ticks_to_us_floor64(k_uptime_ticks());
	uint32_t generation;
	bool accepted;
	int32_t error = 0;
	bool ok;

	k_mutex_lock(&packet_mutex, K_FOREVER);
	accepted = atomic_get(&runtime_state) == PUTTTRACK_RUNTIME_ACTIVE &&
		atomic_get(&sensor_health) == PUTTTRACK_SENSOR_HEALTHY &&
		adxl367_ready && bmi270_ready &&
		current_stream_rate_hz == MOTION_STREAM_RATE_HZ &&
		motion_ring_count >= 50U;
	if (accepted) {
		pickup_shadow_generation++;
		pickup_shadow_go_us = go_us;
		pickup_shadow_armed = true;
	} else {
		error = -EAGAIN;
	}
	generation = pickup_shadow_generation;
	k_mutex_unlock(&packet_mutex);

	ok = zcbor_tstr_put_lit(zse, "proto") &&
	     zcbor_uint32_put(zse, PUTTTRACK_PROTOCOL_VERSION) &&
	     zcbor_tstr_put_lit(zse, "accepted") &&
	     zcbor_bool_put(zse, accepted) &&
	     zcbor_tstr_put_lit(zse, "generation") &&
	     zcbor_uint32_put(zse, generation) &&
	     zcbor_tstr_put_lit(zse, "go_us") &&
	     zcbor_uint64_put(zse, accepted ? go_us : 0U) &&
	     zcbor_tstr_put_lit(zse, "error") &&
	     zcbor_int32_put(zse, error) &&
	     zcbor_tstr_put_lit(zse, "authority") &&
	     zcbor_bool_put(zse, false);

	return ok ? MGMT_ERR_EOK : MGMT_ERR_EMSGSIZE;
}

static int putttrack_mgmt_pickup_shadow_result(struct smp_streamer *ctxt)
{
	zcbor_state_t *zse = ctxt->writer->zs;
	struct pt_pickup_shadow_result result;
	uint64_t go_us = 0U;
	uint64_t earliest_us = 0U;
	uint32_t generation = 0U;
	uint32_t start_cycles;
	uint32_t runtime_us;
	uint16_t sample_count = 0U;
	uint16_t start_index;
	bool armed;
	const char *decision_text;
	struct zcbor_string decision_value;
	struct zcbor_string detector_value = {
		.value = (const uint8_t *)PT_PICKUP_SHADOW_DETECTOR_ID,
		.len = sizeof(PT_PICKUP_SHADOW_DETECTOR_ID) - 1U,
	};
	struct zcbor_string hash_value = {
		.value = (const uint8_t *)PT_PICKUP_SHADOW_DETECTOR_SHA256,
		.len = sizeof(PT_PICKUP_SHADOW_DETECTOR_SHA256) - 1U,
	};
	bool ok;

