ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
	memset(&result, 0, sizeof(result));
	result.decision = PT_PICKUP_SHADOW_UNARMED;
	k_mutex_lock(&packet_mutex, K_FOREVER);
	armed = pickup_shadow_armed;
	if (armed) {
		go_us = pickup_shadow_go_us;
		generation = pickup_shadow_generation;
		earliest_us = go_us > 1000000ULL ? go_us - 1000000ULL : 0U;
		start_index = (motion_ring_write_index + MOTION_HISTORY_SAMPLES -
			       motion_ring_count) % MOTION_HISTORY_SAMPLES;
		for (size_t index = 0U;
		     index < motion_ring_count &&
		     sample_count < PICKUP_SHADOW_SNAPSHOT_SAMPLES;
		     index++) {
			const uint8_t *packet =
				motion_ring[(start_index + index) % MOTION_HISTORY_SAMPLES];
			uint64_t timestamp = sys_get_le64(&packet[8]);

			if (timestamp >= earliest_us) {
				motion_packet_to_pickup_sample(
					packet, &pickup_shadow_snapshot[sample_count]);
				sample_count++;
			}
		}
	}
	k_mutex_unlock(&packet_mutex);

	start_cycles = k_cycle_get_32();
	if (armed) {
		pt_pickup_shadow_evaluate(pickup_shadow_snapshot, sample_count,
					  go_us, true, &result);
	}
	runtime_us = k_cyc_to_us_floor32(k_cycle_get_32() - start_cycles);
	increment_saturating(&pickup_shadow_evaluation_count);
	if (runtime_us > pickup_shadow_max_runtime_us) {
		pickup_shadow_max_runtime_us = runtime_us;
	}
	decision_text = pt_pickup_shadow_decision_name(result.decision);
	decision_value = (struct zcbor_string) {
		.value = (const uint8_t *)decision_text,
		.len = strlen(decision_text),
	};

	ok = zcbor_tstr_put_lit(zse, "proto") &&
	     zcbor_uint32_put(zse, PUTTTRACK_PROTOCOL_VERSION) &&
	     zcbor_tstr_put_lit(zse, "detector") &&
	     zcbor_tstr_encode(zse, &detector_value) &&
	     zcbor_tstr_put_lit(zse, "detector_sha256") &&
	     zcbor_tstr_encode(zse, &hash_value) &&
	     zcbor_tstr_put_lit(zse, "generation") &&
	     zcbor_uint32_put(zse, generation) &&
	     zcbor_tstr_put_lit(zse, "go_us") &&
	     zcbor_uint64_put(zse, go_us) &&
	     zcbor_tstr_put_lit(zse, "decision") &&
	     zcbor_tstr_encode(zse, &decision_value) &&
	     zcbor_tstr_put_lit(zse, "reason_mask") &&
	     zcbor_uint32_put(zse, result.reason_mask) &&
	     zcbor_tstr_put_lit(zse, "rule_pass_mask") &&
	     zcbor_uint32_put(zse, result.rule_pass_mask) &&
	     zcbor_tstr_put_lit(zse, "sample_count") &&
	     zcbor_uint32_put(zse, sample_count) &&
	     zcbor_tstr_put_lit(zse, "baseline_count") &&
	     zcbor_uint32_put(zse, result.baseline_sample_count) &&
	     zcbor_tstr_put_lit(zse, "baseline_duration_ms") &&
	     zcbor_int32_put(zse,
		pickup_shadow_scaled(result.baseline_duration_s, 1000.0)) &&
	     zcbor_tstr_put_lit(zse, "baseline_accel_sd_micro_ms2") &&
	     zcbor_int32_put(zse, pickup_shadow_scaled(
		result.baseline_accel_norm_stdev_mps2, 1000000.0)) &&
	     zcbor_tstr_put_lit(zse, "baseline_gyro_rms_micro_rads") &&
	     zcbor_int32_put(zse, pickup_shadow_scaled(
		result.baseline_gyro_norm_rms_rads, 1000000.0)) &&
	     zcbor_tstr_put_lit(zse, "onset_us") &&
	     zcbor_uint64_put(zse, result.onset_source_monotonic_us) &&
	     zcbor_tstr_put_lit(zse, "onset_offset_ms") &&
	     zcbor_int32_put(zse,
		pickup_shadow_scaled(result.onset_offset_from_go_s, 1000.0)) &&
	     zcbor_tstr_put_lit(zse, "positive_impulse_micro_mps") &&
	     zcbor_int32_put(zse, pickup_shadow_scaled(
		result.positive_vertical_impulse_mps, 1000000.0)) &&
	     zcbor_tstr_put_lit(zse, "mean_gyro_micro_rads") &&
	     zcbor_int32_put(zse, pickup_shadow_scaled(
		result.mean_gyro_norm_1s_rads, 1000000.0)) &&
	     zcbor_tstr_put_lit(zse, "axis_consistency_ppm") &&
	     zcbor_int32_put(zse, pickup_shadow_scaled(
		result.gyro_axis_consistency_1s, 1000000.0)) &&
	     zcbor_tstr_put_lit(zse, "gyro_clip_samples") &&
	     zcbor_uint32_put(zse, result.gyro_clip_samples) &&
	     zcbor_tstr_put_lit(zse, "gyro_feature_count") &&
	     zcbor_uint32_put(zse, result.feature_sample_count_gyro) &&
	     zcbor_tstr_put_lit(zse, "impulse_feature_count") &&
	     zcbor_uint32_put(zse, result.feature_sample_count_impulse) &&
	     zcbor_tstr_put_lit(zse, "source_rate_millihz") &&
	     zcbor_int32_put(zse,
		pickup_shadow_scaled(result.source_rate_hz, 1000.0)) &&
	     zcbor_tstr_put_lit(zse, "runtime_us") &&
	     zcbor_uint32_put(zse, runtime_us) &&
	     zcbor_tstr_put_lit(zse, "authority") &&
	     zcbor_bool_put(zse, false);

	return ok ? MGMT_ERR_EOK : MGMT_ERR_EMSGSIZE;
}

static int putttrack_mgmt_status(struct smp_streamer *ctxt)
{
	zcbor_state_t *zse = ctxt->writer->zs;
	enum putttrack_power_policy policy = atomic_get(&power_policy);
	enum putttrack_runtime_state state = atomic_get(&runtime_state);
	enum putttrack_sensor_health health = atomic_get(&sensor_health);
	const char *policy_text = power_policy_name(policy);
	const char *state_text = runtime_state_name(state);
	const char *health_text = sensor_health_name(health);
	char device_id_hex[DEVICE_ID_MAX_SIZE * 2];
	char boot_id_hex[BOOT_ID_SIZE * 2];
	struct zcbor_string device_id_value = {
		.value = (const uint8_t *)device_id_hex,
		.len = device_id_len * 2U,
	};
	struct zcbor_string boot_id_value = {
		.value = (const uint8_t *)boot_id_hex,
		.len = sizeof(boot_id) * 2U,
	};
	struct zcbor_string firmware_value = {
		.value = (const uint8_t *)PUTTTRACK_FIRMWARE_VERSION,
		.len = strlen(PUTTTRACK_FIRMWARE_VERSION),
	};
	struct zcbor_string power_policy_value = {
		.value = (const uint8_t *)policy_text,
		.len = strlen(policy_text),
	};
	struct zcbor_string runtime_state_value = {
		.value = (const uint8_t *)state_text,
		.len = strlen(state_text),
	};
	struct zcbor_string sensor_health_value = {
		.value = (const uint8_t *)health_text,
		.len = strlen(health_text),
	};
	uint32_t status_sequence;
	bool ok;

	sample_battery();
	bytes_to_hex(device_id, device_id_len, device_id_hex);
	bytes_to_hex(boot_id, sizeof(boot_id), boot_id_hex);
	build_status_packet();
	k_mutex_lock(&packet_mutex, K_FOREVER);
	status_sequence = sys_get_le32(&status_packet[4]);
	k_mutex_unlock(&packet_mutex);

	ok = zcbor_tstr_put_lit(zse, "proto") &&
	     zcbor_uint32_put(zse, PUTTTRACK_PROTOCOL_VERSION) &&
	     zcbor_tstr_put_lit(zse, "seq") &&
	     zcbor_uint32_put(zse, status_sequence) &&
	     zcbor_tstr_put_lit(zse, "uptime_ms") &&
	     zcbor_uint64_put(zse, (uint64_t)k_uptime_get()) &&
	     zcbor_tstr_put_lit(zse, "reset") &&
	     zcbor_uint32_put(zse, reset_cause) &&
	     zcbor_tstr_put_lit(zse, "sensor_errors") &&
	     zcbor_uint32_put(zse, sensor_error_count) &&
	     zcbor_tstr_put_lit(zse, "notify_drops") &&
	     zcbor_uint32_put(zse, notify_drop_count) &&
	     zcbor_tstr_put_lit(zse, "stream_hz") &&
	     zcbor_uint32_put(zse, current_stream_rate_hz) &&
	     zcbor_tstr_put_lit(zse, "adxl_odr_hz") &&
	     zcbor_uint32_put(zse, current_adxl367_odr_hz) &&
	     zcbor_tstr_put_lit(zse, "adxl_range_g") &&
	     zcbor_uint32_put(zse, ADXL367_RANGE_G) &&
	     zcbor_tstr_put_lit(zse, "bmi_accel_odr_hz") &&
	     zcbor_uint32_put(zse, current_bmi270_accel_odr_hz) &&
	     zcbor_tstr_put_lit(zse, "bmi_accel_range_g") &&
	     zcbor_uint32_put(zse, BMI270_ACCEL_RANGE_G) &&
	     zcbor_tstr_put_lit(zse, "bmi_gyro_odr_hz") &&
	     zcbor_uint32_put(zse, current_bmi270_gyro_odr_hz) &&
	     zcbor_tstr_put_lit(zse, "bmi_gyro_range_dps") &&
	     zcbor_uint32_put(zse, BMI270_GYRO_RANGE_DPS) &&
	     zcbor_tstr_put_lit(zse, "adxl_clips") &&
	     zcbor_uint32_put(zse, adxl367_clip_count) &&
	     zcbor_tstr_put_lit(zse, "bmi_accel_clips") &&
	     zcbor_uint32_put(zse, bmi270_accel_clip_count) &&
	     zcbor_tstr_put_lit(zse, "bmi_gyro_clips") &&
	     zcbor_uint32_put(zse, bmi270_gyro_clip_count) &&
	     zcbor_tstr_put_lit(zse, "adxl_ready") &&
	     zcbor_bool_put(zse, adxl367_ready) &&
	     zcbor_tstr_put_lit(zse, "bmi_ready") &&
	     zcbor_bool_put(zse, bmi270_ready) &&
	     zcbor_tstr_put_lit(zse, "device_id") &&
	     zcbor_tstr_encode(zse, &device_id_value) &&
	     zcbor_tstr_put_lit(zse, "boot_id") &&
	     zcbor_tstr_encode(zse, &boot_id_value) &&
	     zcbor_tstr_put_lit(zse, "fw") &&
	     zcbor_tstr_encode(zse, &firmware_value) &&
	     zcbor_tstr_put_lit(zse, "power_policy") &&
	     zcbor_tstr_encode(zse, &power_policy_value) &&
	     zcbor_tstr_put_lit(zse, "runtime_state") &&
	     zcbor_tstr_encode(zse, &runtime_state_value) &&
	     zcbor_tstr_put_lit(zse, "sensor_health") &&
	     zcbor_tstr_encode(zse, &sensor_health_value) &&
	     zcbor_tstr_put_lit(zse, "capture_safe") &&
	     zcbor_bool_put(zse, health == PUTTTRACK_SENSOR_HEALTHY &&
			    adxl367_ready && bmi270_ready &&
			    state == PUTTTRACK_RUNTIME_ACTIVE &&
			    current_stream_rate_hz == MOTION_STREAM_RATE_HZ) &&
	     zcbor_tstr_put_lit(zse, "sensor_faults") &&
	     zcbor_uint32_put(zse, sensor_fault_count) &&
	     zcbor_tstr_put_lit(zse, "recovery_generation") &&
	     zcbor_uint32_put(zse, sensor_recovery_generation) &&
	     zcbor_tstr_put_lit(zse, "recovery_attempts") &&
	     zcbor_uint32_put(zse, sensor_recovery_attempt_count) &&
	     zcbor_tstr_put_lit(zse, "recovery_successes") &&
	     zcbor_uint32_put(zse, sensor_recovery_success_count) &&
	     zcbor_tstr_put_lit(zse, "recovery_failures") &&
	     zcbor_uint32_put(zse, sensor_recovery_failure_count) &&
	     zcbor_tstr_put_lit(zse, "adxl_error_streak") &&
	     zcbor_uint32_put(zse, adxl367_error_streak) &&
	     zcbor_tstr_put_lit(zse, "bmi_error_streak") &&
	     zcbor_uint32_put(zse, bmi270_error_streak) &&
	     zcbor_tstr_put_lit(zse, "last_sensor_error_bits") &&
	     zcbor_uint32_put(zse, last_sensor_error_bits) &&
	     zcbor_tstr_put_lit(zse, "last_sensor_error_ms") &&
	     zcbor_uint64_put(zse, last_sensor_error_uptime_ms) &&
	     zcbor_tstr_put_lit(zse, "auto_reboots") &&
	     zcbor_uint32_put(zse, sensor_reboot_retention.reboot_count) &&
	     zcbor_tstr_put_lit(zse, "auto_reboot_fault_bits") &&
	     zcbor_uint32_put(zse, sensor_reboot_retention.last_fault_bits) &&
	     zcbor_tstr_put_lit(zse, "auto_reboot_guard") &&
	     zcbor_bool_put(zse, sensor_reboot_retention.guard != 0U) &&
	     zcbor_tstr_put_lit(zse, "auto_reboot_pending") &&
	     zcbor_bool_put(zse, health == PUTTTRACK_SENSOR_DEGRADED &&
			    sensor_reboot_retention.guard == 0U) &&
	     zcbor_tstr_put_lit(zse, "idle_health_check_ms") &&
	     zcbor_uint32_put(zse, IDLE_SENSOR_HEALTH_CHECK_MS) &&
	     zcbor_tstr_put_lit(zse, "power_transitions") &&
	     zcbor_uint32_put(zse, power_transition_count) &&
	     zcbor_tstr_put_lit(zse, "idle_timeout_ms") &&
	     zcbor_uint32_put(zse, AUTO_IDLE_TIMEOUT_MS) &&
	     zcbor_tstr_put_lit(zse, "wake_poll_ms") &&
	     zcbor_uint32_put(zse,
			      atomic_get(&idle_wake_interrupt_enabled) != 0 ?
			      0U : IDLE_WAKE_SAMPLE_PERIOD_MS) &&
	     zcbor_tstr_put_lit(zse, "wake_interrupt") &&
	     zcbor_bool_put(zse, atomic_get(&idle_wake_interrupt_enabled) != 0) &&
	     zcbor_tstr_put_lit(zse, "adxl_wakeup_mode") &&
	     zcbor_bool_put(zse, atomic_get(&adxl367_wakeup_mode_enabled) != 0) &&
	     zcbor_tstr_put_lit(zse, "adv_interval_min_ms") &&
	     zcbor_uint32_put(zse, current_adv_interval_min_ms) &&
	     zcbor_tstr_put_lit(zse, "adv_interval_max_ms") &&
	     zcbor_uint32_put(zse, current_adv_interval_max_ms) &&
	     zcbor_tstr_put_lit(zse, "adv_start_errors") &&
	     zcbor_uint32_put(zse, advertising_start_error_count) &&
	     zcbor_tstr_put_lit(zse, "pm_errors") &&
	     zcbor_uint32_put(zse, power_management_error_count) &&
	     zcbor_tstr_put_lit(zse, "bmi_spi_suspended") &&
	     zcbor_bool_put(zse, atomic_get(&bmi270_spi_suspended) != 0) &&
	     zcbor_tstr_put_lit(zse, "battery_supported") &&
	     zcbor_bool_put(zse, battery_supported) &&
	     zcbor_tstr_put_lit(zse, "battery_sample_valid") &&
	     zcbor_bool_put(zse, battery_sample_valid) &&
	     zcbor_tstr_put_lit(zse, "battery_sample_error") &&
	     zcbor_int32_put(zse, battery_sample_error) &&
	     zcbor_tstr_put_lit(zse, "battery_voltage_mv") &&
	     zcbor_uint32_put(zse, battery_voltage_mv) &&
	     zcbor_tstr_put_lit(zse, "battery_soc_percent") &&
	     zcbor_uint32_put(zse, battery_soc_percent) &&
	     zcbor_tstr_put_lit(zse, "battery_soc_estimated") &&
	     zcbor_bool_put(zse, true) &&
	     zcbor_tstr_put_lit(zse, "pickup_shadow_supported") &&
	     zcbor_bool_put(zse, true) &&
	     zcbor_tstr_put_lit(zse, "pickup_shadow_armed") &&
	     zcbor_bool_put(zse, pickup_shadow_armed) &&
	     zcbor_tstr_put_lit(zse, "pickup_shadow_generation") &&
	     zcbor_uint32_put(zse, pickup_shadow_generation) &&
	     zcbor_tstr_put_lit(zse, "pickup_shadow_evaluations") &&
	     zcbor_uint32_put(zse, pickup_shadow_evaluation_count) &&
	     zcbor_tstr_put_lit(zse, "pickup_shadow_max_runtime_us") &&
	     zcbor_uint32_put(zse, pickup_shadow_max_runtime_us) &&
	     zcbor_tstr_put_lit(zse, "pickup_shadow_authority") &&
	     zcbor_bool_put(zse, false);

