ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
	if (atomic_get(&sensor_health) != PUTTTRACK_SENSOR_RECOVERING ||
	    k_uptime_get() < next_sensor_recovery_ms) {
		return;
	}

	increment_saturating(&sensor_recovery_attempt_count);
	sensor_recovery_attempts_in_episode++;
	if (atomic_get(&bmi270_spi_suspended) != 0) {
		rc = pm_device_action_run(bmi270_spi, PM_DEVICE_ACTION_RESUME);
		if (rc == 0) {
			atomic_clear(&bmi270_spi_suspended);
		} else {
			increment_saturating(&power_management_error_count);
		}
	}

	adxl367_ready = device_is_ready(adxl367);
	bmi270_ready = device_is_ready(bmi270);
	errors = 0U;
	if (!adxl367_ready) {
		errors |= SENSOR_ERROR_ADXL367_FETCH;
	}
	if (!bmi270_ready || configure_bmi270_full_scale() != 0) {
		errors |= SENSOR_ERROR_BMI270_FETCH;
	}
	if (errors == 0U && configure_active_sensors() != 0) {
		errors |= SENSOR_ERROR_ADXL367_FETCH | SENSOR_ERROR_BMI270_FETCH;
	}
	for (size_t sample = 0U; errors == 0U && sample < 3U; sample++) {
		errors = verify_active_sensor_samples();
		if (errors == 0U && sample < 2U) {
			k_sleep(K_MSEC(20));
		}
	}

	if (errors == 0U) {
		adxl367_ready = true;
		bmi270_ready = true;
		adxl367_error_streak = 0U;
		bmi270_error_streak = 0U;
		increment_saturating(&sensor_recovery_success_count);
		atomic_set(&sensor_health, PUTTTRACK_SENSOR_HEALTHY);
		sensor_healthy_since_ms = k_uptime_get();
		last_active_motion_ms = k_uptime_get();
		current_stream_rate_hz = MOTION_STREAM_RATE_HZ;
		clear_motion_history();
		return;
	}

	increment_saturating(&sensor_recovery_failure_count);
	last_sensor_error_bits = errors;
	last_sensor_error_uptime_ms = (uint64_t)k_uptime_get();
	adxl367_ready = (errors & (SENSOR_ERROR_ADXL367_FETCH |
				  SENSOR_ERROR_ADXL367_READ)) == 0U;
	bmi270_ready = (errors & (SENSOR_ERROR_BMI270_FETCH |
				SENSOR_ERROR_BMI270_ACCEL |
				SENSOR_ERROR_BMI270_GYRO)) == 0U;
	if (sensor_recovery_attempts_in_episode >= SENSOR_RECOVERY_MAX_ATTEMPTS) {
		atomic_set(&sensor_health, PUTTTRACK_SENSOR_DEGRADED);
		refresh_advertising();
		return;
	}
	next_sensor_recovery_ms = k_uptime_get() +
		recovery_retry_delay_ms(sensor_recovery_attempts_in_episode);
}

static void service_sensor_recovery_policy(void)
{
	enum putttrack_sensor_health health = atomic_get(&sensor_health);
	int64_t now_ms = k_uptime_get();

	if (health == PUTTTRACK_SENSOR_RECOVERING) {
		attempt_sensor_recovery();
		return;
	}
	if (health == PUTTTRACK_SENSOR_HEALTHY) {
		if (sensor_reboot_retention.guard != 0U &&
		    now_ms - sensor_healthy_since_ms >= SENSOR_REBOOT_GUARD_CLEAR_MS) {
			sensor_reboot_retention.guard = 0U;
		}
		return;
	}
	if (health != PUTTTRACK_SENSOR_DEGRADED ||
	    now_ms - last_active_motion_ms < SENSOR_REBOOT_QUIET_MS ||
	    atomic_get(&ble_connected) != 0) {
		return;
	}
	if (sensor_reboot_retention.guard != 0U) {
		atomic_set(&sensor_health, PUTTTRACK_SENSOR_QUARANTINED);
		refresh_advertising();
		return;
	}

	sensor_reboot_retention.guard = 1U;
	increment_saturating(&sensor_reboot_retention.reboot_count);
	sensor_reboot_retention.last_fault_bits = last_sensor_error_bits;
	sys_reboot(SYS_REBOOT_WARM);
}

static bool vector_delta_exceeds(const struct sensor_value values[3],
				 int32_t previous[3], bool *previous_valid,
				 int32_t threshold)
{
	int32_t current[3];
	int64_t squared_delta = 0;
	int64_t squared_threshold = (int64_t)threshold * threshold;

	for (size_t index = 0; index < 3; index++) {
		current[index] = sensor_value_to_i32_micro(&values[index]);
	}
	if (!*previous_valid) {
		memcpy(previous, current, sizeof(current));
		*previous_valid = true;
		return false;
	}
	for (size_t index = 0; index < 3; index++) {
		int64_t delta = (int64_t)current[index] - previous[index];

		squared_delta += delta * delta;
	}
	memcpy(previous, current, sizeof(current));
	return squared_delta >= squared_threshold;
}

static bool gyro_exceeds(const struct sensor_value values[3], int32_t threshold)
{
	for (size_t index = 0; index < 3; index++) {
		int64_t value = sensor_value_to_i32_micro(&values[index]);

		if (value < 0) {
			value = -value;
		}
		if (value >= threshold) {
			return true;
		}
	}
	return false;
}

static bool sample_motion(void)
{
	struct sensor_value adxl_accel[3] = {0};
	struct sensor_value bmi_accel[3] = {0};
	struct sensor_value bmi_gyro[3] = {0};
	uint8_t flags = 0U;
	uint32_t errors = 0U;
	uint8_t snapshot[MOTION_PACKET_SIZE];
	int rc;
	bool motion_detected = false;

	sequence++;
	if (adxl367_ready) {
		rc = sensor_sample_fetch(adxl367);
		if (rc != 0) {
			errors |= SENSOR_ERROR_ADXL367_FETCH;
		} else if (sensor_channel_get(adxl367, SENSOR_CHAN_ACCEL_XYZ,
					      adxl_accel) != 0) {
			errors |= SENSOR_ERROR_ADXL367_READ;
		} else {
			flags |= MOTION_FLAG_ADXL367_VALID;
		}
	} else {
		errors |= SENSOR_ERROR_ADXL367_FETCH;
	}

	if (bmi270_ready) {
		rc = sensor_sample_fetch(bmi270);
		if (rc != 0) {
			errors |= SENSOR_ERROR_BMI270_FETCH;
		} else {
			if (sensor_channel_get(bmi270, SENSOR_CHAN_ACCEL_XYZ,
					       bmi_accel) != 0) {
				errors |= SENSOR_ERROR_BMI270_ACCEL;
			}
			if (sensor_channel_get(bmi270, SENSOR_CHAN_GYRO_XYZ,
					       bmi_gyro) != 0) {
				errors |= SENSOR_ERROR_BMI270_GYRO;
			}
			if ((errors & (SENSOR_ERROR_BMI270_ACCEL |
				       SENSOR_ERROR_BMI270_GYRO)) == 0U) {
				flags |= MOTION_FLAG_BMI270_VALID;
			}
		}
	} else {
		errors |= SENSOR_ERROR_BMI270_FETCH;
	}

	if ((flags & MOTION_FLAG_ADXL367_VALID) != 0U) {
		motion_detected |= vector_delta_exceeds(
			adxl_accel, active_previous_adxl,
			&active_previous_adxl_valid, ACTIVE_DELTA_MICRO_MS2);
	}
	if ((flags & MOTION_FLAG_BMI270_VALID) != 0U) {
		motion_detected |= gyro_exceeds(bmi_gyro, ACTIVE_GYRO_MICRO_RADS);
	}

	memset(snapshot, 0, sizeof(snapshot));
	snapshot[0] = PUTTTRACK_PROTOCOL_VERSION;
	snapshot[1] = flags;
	sys_put_le16(MOTION_PACKET_SIZE, &snapshot[2]);
	sys_put_le32(sequence, &snapshot[4]);
	sys_put_le64(k_ticks_to_us_floor64(k_uptime_ticks()), &snapshot[8]);

	for (size_t index = 0; index < 3; index++) {
		sys_put_le32(sensor_value_to_i32_micro(&adxl_accel[index]),
			     &snapshot[16 + index * 4]);
		sys_put_le32(sensor_value_to_i32_micro(&bmi_accel[index]),
			     &snapshot[28 + index * 4]);
		sys_put_le32(sensor_value_to_i32_micro(&bmi_gyro[index]),
			     &snapshot[40 + index * 4]);
	}
	if ((flags & MOTION_FLAG_ADXL367_VALID) != 0U &&
	    packet_vector_clipped(snapshot, 16U, ADXL367_CLIP_MICRO_MS2)) {
		adxl367_clip_count++;
	}
	if ((flags & MOTION_FLAG_BMI270_VALID) != 0U &&
	    packet_vector_clipped(snapshot, 28U, BMI270_ACCEL_CLIP_MICRO_MS2)) {
		bmi270_accel_clip_count++;
	}
	if ((flags & MOTION_FLAG_BMI270_VALID) != 0U &&
	    packet_vector_clipped(snapshot, 40U, BMI270_GYRO_CLIP_MICRO_RADS)) {
		bmi270_gyro_clip_count++;
	}
	sys_put_le32(errors, &snapshot[52]);

