ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
	k_mutex_lock(&packet_mutex, K_FOREVER);
	memcpy(motion_packet, snapshot, sizeof(motion_packet));
	memcpy(motion_ring[motion_ring_write_index], snapshot, sizeof(snapshot));
	motion_ring_write_index = (motion_ring_write_index + 1U) % MOTION_HISTORY_SAMPLES;
	if (motion_ring_count < MOTION_HISTORY_SAMPLES) {
		motion_ring_count++;
	}
	k_mutex_unlock(&packet_mutex);

	if (atomic_get(&notify_enabled) != 0) {
		rc = bt_gatt_notify(NULL, &putttrack_service.attrs[4],
				    snapshot, sizeof(snapshot));
		if (rc != 0 && rc != -ENOTCONN) {
			notify_drop_count++;
		}
	}
	record_sensor_sample_result(errors);

	return motion_detected;
}

static bool sample_idle_wake_sensor(void)
{
	struct sensor_value adxl_accel[3] = {0};
	int32_t current[3];
	int64_t squared_delta = 0;
	const int64_t squared_threshold =
		(int64_t)IDLE_WAKE_DELTA_MICRO_MS2 * IDLE_WAKE_DELTA_MICRO_MS2;

	if (!adxl367_ready || sensor_sample_fetch(adxl367) != 0) {
		record_sensor_sample_result(SENSOR_ERROR_ADXL367_FETCH);
		return false;
	}
	if (sensor_channel_get(adxl367, SENSOR_CHAN_ACCEL_XYZ, adxl_accel) != 0) {
		record_sensor_sample_result(SENSOR_ERROR_ADXL367_READ);
		return false;
	}
	record_sensor_sample_result(0U);
	for (size_t index = 0; index < 3; index++) {
		current[index] = sensor_value_to_i32_micro(&adxl_accel[index]);
	}
	if (!idle_adxl_baseline_valid) {
		memcpy(idle_adxl_baseline, current, sizeof(current));
		idle_adxl_baseline_valid = true;
		idle_wake_samples = 0U;
		return false;
	}
	for (size_t index = 0; index < 3; index++) {
		int64_t delta = (int64_t)current[index] - idle_adxl_baseline[index];

		squared_delta += delta * delta;
	}
	if (squared_delta >= squared_threshold) {
		idle_wake_samples++;
		return idle_wake_samples >= IDLE_WAKE_REQUIRED_SAMPLES;
	}

	idle_wake_samples = 0U;
	for (size_t index = 0; index < 3; index++) {
		idle_adxl_baseline[index] =
			(int32_t)(((int64_t)idle_adxl_baseline[index] * 7 +
				   current[index]) / 8);
	}
	return false;
}

static bool enter_idle_state(void)
{
	int rc;

	if (atomic_get(&runtime_state) == PUTTTRACK_RUNTIME_IDLE) {
		return true;
	}
	if (configure_idle_sensors() != 0) {
		begin_sensor_recovery(SENSOR_ERROR_ADXL367_FETCH |
				      SENSOR_ERROR_BMI270_FETCH);
		return false;
	}
	if (adxl367_ready) {
		rc = enable_idle_wake_interrupt();
		if (rc != 0) {
			increment_saturating(&power_management_error_count);
			begin_sensor_recovery(SENSOR_ERROR_ADXL367_FETCH);
			return false;
		}
		rc = set_adxl367_wakeup_mode(true);
		if (rc != 0) {
			increment_saturating(&power_management_error_count);
			begin_sensor_recovery(SENSOR_ERROR_ADXL367_FETCH);
			return false;
		}
	} else {
		begin_sensor_recovery(SENSOR_ERROR_ADXL367_FETCH);
		return false;
	}
	if (bmi270_ready && atomic_get(&bmi270_spi_suspended) == 0) {
		rc = pm_device_action_run(bmi270_spi, PM_DEVICE_ACTION_SUSPEND);
		if (rc == 0) {
			atomic_set(&bmi270_spi_suspended, 1);
		} else {
			increment_saturating(&power_management_error_count);
		}
	}
	current_stream_rate_hz = 0U;
	idle_adxl_baseline_valid = false;
	idle_wake_samples = 0U;
	last_idle_sensor_health_check_ms = k_uptime_get();
	atomic_set(&runtime_state, PUTTTRACK_RUNTIME_IDLE);
	current_adv_interval_min_ms = IDLE_ADV_INTERVAL_MIN_MS;
	current_adv_interval_max_ms = IDLE_ADV_INTERVAL_MAX_MS;
	power_transition_count++;
	refresh_advertising();
	return true;
}

static bool enter_active_state(void)
{
	int rc;

	if (atomic_get(&runtime_state) == PUTTTRACK_RUNTIME_ACTIVE) {
		return true;
	}
	if (disable_idle_wake_interrupt() != 0) {
		increment_saturating(&power_management_error_count);
		begin_sensor_recovery(SENSOR_ERROR_ADXL367_FETCH);
		return false;
	}
	if (adxl367_ready && set_adxl367_wakeup_mode(false) != 0) {
		increment_saturating(&power_management_error_count);
		begin_sensor_recovery(SENSOR_ERROR_ADXL367_FETCH);
		return false;
	}
	if (bmi270_ready && atomic_get(&bmi270_spi_suspended) != 0) {
		rc = pm_device_action_run(bmi270_spi, PM_DEVICE_ACTION_RESUME);
		if (rc != 0) {
			increment_saturating(&power_management_error_count);
			begin_sensor_recovery(SENSOR_ERROR_BMI270_FETCH);
			return false;
		}
		atomic_clear(&bmi270_spi_suspended);
	}
	if (configure_active_sensors() != 0) {
		begin_sensor_recovery(SENSOR_ERROR_ADXL367_FETCH |
				      SENSOR_ERROR_BMI270_FETCH);
		return false;
	}
	clear_motion_history();
	current_stream_rate_hz = MOTION_STREAM_RATE_HZ;
	active_previous_adxl_valid = false;
	last_active_motion_ms = k_uptime_get();
	atomic_set(&runtime_state, PUTTTRACK_RUNTIME_ACTIVE);
	current_adv_interval_min_ms = 100U;
	current_adv_interval_max_ms = 150U;
	power_transition_count++;
	refresh_advertising();
	return true;
}

#if defined(CONFIG_PUTTTRACK_NFC_SERVICE)
static void nfc_callback(void *context, nfc_t2t_event_t event,
			 const uint8_t *data, size_t data_length)
{
	ARG_UNUSED(context);
	ARG_UNUSED(data);
	ARG_UNUSED(data_length);

	switch (event) {
	case NFC_T2T_EVENT_FIELD_ON:
		atomic_inc(&nfc_field_on_count);
#if defined(CONFIG_PUTTTRACK_NFC_SYSTEM_OFF_TEST)
		if (atomic_cas(&system_off_pending, 1, 0)) {
			(void)k_work_cancel_delayable(&system_off_work);
			system_off_entry_error = -EBUSY;
		}
#endif
		if (atomic_cas(&nfc_field_present, 0, 1)) {
			(void)k_work_submit(&nfc_service_window_open_work);
		} else {
			atomic_inc(&nfc_service_window_suppressed_count);
		}
		break;
	case NFC_T2T_EVENT_FIELD_OFF:
		atomic_inc(&nfc_field_off_count);
		atomic_clear(&nfc_field_present);
		break;
	case NFC_T2T_EVENT_DATA_READ:
		atomic_inc(&nfc_data_read_count);
		break;
	default:
		break;
	}
}

static int initialize_nfc_service(void)
{
	char device_id_hex[DEVICE_ID_MAX_SIZE * 2U + 1U];
	char uri[NFC_URI_BUFFER_SIZE];
	uint32_t ndef_length = sizeof(nfc_ndef_buffer);
	int uri_length;
	int rc;

	bytes_to_hex(device_id, device_id_len, device_id_hex);
	device_id_hex[device_id_len * 2U] = '\0';
	uri_length = snprintf(uri, sizeof(uri),
			      "putttrack://service/tag/%s?fw=%s",
			      device_id_hex, PUTTTRACK_FIRMWARE_VERSION);
	if (uri_length < 0 || (size_t)uri_length >= sizeof(uri)) {
		nfc_setup_error = -ENOSPC;
		return nfc_setup_error;
	}

